package SuperMarioBros;
/*
 * Όλα αφορούν την υπερκλάση sidescroller.java αλλα λόγω του μεγέθους της τα πρόσθεσα εδώ
 * 
 * ΔΙΑΦΟΡΕΣ ΜΕ ΤΟ ΕΠΑΛ
 * 
 * Αντι για να κερδίζεις +1 Zωή στα 100 Κερδίζει στα 1000
 * Δεν υπάρχει SAVE LOAD για μια πίστα δεν χρειαζόταν
 * Δεν μεγαλώνει ο MARIO σε super mario τα γραφικά για την καταστροφή των blocks αποδείχτηκαν λίγο δύσκολα
 * Αντι αυτού τα mushrooms αντικαταστάθηκαν με 1up shroom που δίνουν +1 ζωή (πραγμα που ειανι το ίδιο πραγμα δεδομένου
 * του ότι τα τέρατα δεν γίνονται ρεσετ μεχρι να γίνει game over)
 * 
 * Το ΑΙcharacter turtle δεν συμπεριλήφθηκε στο ΕΠΑΛ αλλα το προσθέσαμε
 * η κίνηση είναι παράξενη αλλα νομίζω φταίνε τα .png που βρήκαμε
 * 
 * Δεν συμπεριβάλονται τα effects
 * Super Mario
 * Star Mario
 * FireFlower Mario
 * Υπάρχει κώδικας για την φόρτωση των animatios και λειτουργικός
 * κώδικας για το star mario αλλά είναι σε σχόλια αφού δεν τα συμπεριλάβαμε
 * 
 * Τέλος όταν τερματίζει ο ήρωας μετακινείται στην αρχή της πρώτης πίστας
 * πράγμα που διατυπώνετε στο τέλος  του  Level#_level.txt της αντίστοιχης 
 * πίστας
 * 
 * BUGGS
 * Τα εξής δεν δούλεψαν όπως θα θέλαμε:
 * 1)όταν ο παίχτης δημιουργεί ένα νέο AIcharacter που είναι bonus και δημιουργήσει ακόμα ένα 
 * πρίν το διαγράψει λόγω χρόνου το πρώτο εξαφανιζέται.
 * Σε αυτό οφείλεται  το ότι μερικές φορές δεν εμφανίζεται το νομισμα
 * 
 * 2)Ο ήχος μπλέκεται προσπάθησα με .drain / νέα αντικείμενα και .setFrame[0] να το αλλάξω αλλά δεν κατάλαβα τι φταίε
 *  παρόλα αυτά όμως δεν είναι ιδιαίτερα ενοχλητικό
 * 
 * 3
 * This is the entry point for the program.
 * 
 */
public class Main {
//Entry point
public static void main (String[] args)
{
  SideScroller game = new SideScroller();
  game.run();
}
}